import os
from config import Config

class Script(object):
    
    START_TXT = """<b>Hᴇʟʟᴏ {} 👋
    
⍟ I'ᴍ Aɴ Iɴꜱᴛᴀ Dᴏᴡɴʟᴏᴀᴅᴇʀ Bᴏᴛ 📥
⍟ Sᴇɴᴅ Mᴇ Aɴʏ Iɴꜱᴛᴀɢʀᴀᴍ Lɪɴᴋ (Rᴇᴇʟ / Pᴏꜱᴛ / Vɪᴅᴇᴏ / Pʜᴏᴛᴏ) & I ᴡɪʟʟ Dᴏᴡɴʟᴏᴀᴅ Iᴛ Fᴏʀ Yᴏᴜ !!! 😍</b>

**Cʟɪᴄᴋ Hᴇʟᴘ Bᴜᴛᴛᴏɴ Tᴏ Kɴᴏᴡ Mᴏʀᴇ Aʙᴏᴜᴛ Mᴇ !!! 🤞**"""

    HELP_TXT = """<b><u>Hᴇʟᴘ 🕵🏻‍♂️</b></u>

<u>**Aᴠᴀɪʟᴀʙʟᴇ Cᴏᴍᴍᴀɴᴅꜱ 👇**</u>

<b>⏣ /start - Sᴛᴀʀᴛ Tʜᴇ Bᴏᴛ  
⏣ /help - Hᴏᴡ Tᴏ Uꜱᴇ Mᴇ  
⏣ /about - Aʙᴏᴜᴛ Mᴇ  
⏣ /status - Bᴏᴛ Sᴛᴀᴛᴜꜱ</b>

<b><u>⚜️ Hᴏᴡ Tᴏ Uꜱᴇ ⚜️</b></u>

<b>► Sɪᴍᴘʟʏ Sᴇɴᴅ Mᴇ Aɴʏ Iɴꜱᴛᴀɢʀᴀᴍ Lɪɴᴋ (Rᴇᴇʟ / Pᴏꜱᴛ / Pʜᴏᴛᴏ)  
► I Wɪʟʟ Fᴇᴛᴄʜ Aɴᴅ Sᴇɴᴅ Tʜᴇ Mᴇᴅɪᴀ Dɪʀᴇᴄᴛʟʏ</b>  
"""

    ABOUT_TXT = """<b>
╔════❰ Mʏ Dᴇᴛᴀɪʟꜱ ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⍟ 🤖 Bᴏᴛ Nᴀᴍᴇ : Insta Downloader Bot
║┣⍟ 👨‍💻 Cʀᴇᴀᴛᴏʀ : [Monster Mk ×͜×](https://t.me/Monster_Mk_Bot)
║┣⍟ 🚀 Uᴘᴅᴀᴛᴇ : [Mᴋ x BᴏTᴢ](https://t.me/MKxBoTz)
║┣⍟ 📡 Hᴏsᴛᴇᴅ Oɴ : Sᴜᴘᴇʀ Fᴀsᴛ Sᴇʀᴠᴇʀ
║┣⍟ 📝 Lᴀɴɢᴜᴀɢᴇ : Pʏᴛʜᴏɴ3
║┣⍟ 📚 Lɪʙʀᴀʀʏ : Pʏʀᴏɢʀᴀᴍ
║┣⍟ 🖥️ Vᴇʀsɪᴏɴ : 1.0
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪
</b>"""

    STATUS_TXT = """
╔════❰ Bᴏᴛ Sᴛᴀᴛᴜꜱ ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⍟ ⏳ Uᴘᴛɪᴍᴇ : `{}`
║┣⍟ 👱 Tᴏᴛᴀʟ Usᴇʀꜱ : `{}`
║┣⍟ 🎬 Tᴏᴛᴀʟ Dᴏᴡɴʟᴏᴀᴅꜱ : `{}`
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪
"""
